#+title: A Random Walk Through Git
#+author: Malte Kiesel, Kaushal Modi

#+property: header-args :eval never-export
#+property: header-args:shell :exports both :results output :session *Git Random Walk*

# Tue Nov 09 16:23:14 EST 2021 - kmodi
# Unable to work on this document until the bug with ob-shell and sessions gets fixed.
# Ref: https://list.orgmode.org/CAFyQvY2AeToQc2G=e+DE4VOTeTFbkvisENipYpW1Y-feu1ov1g@mail.gmail.com/
# Local recipe of this issue: ~/sandbox/org/bug-recipes/ob-shell-truncating-results/t.org

* Git Init
First delete the ~to_be_deleted/~ directory in the current directory
if it already exists.

#+begin_src shell
find . -type d -name to_be_deleted | xargs rm -rf
#+end_src

#+RESULTS:

#+begin_src shell
git init to_be_deleted
cd to_be_deleted

git config --local init.defaultBranch main
git config --local user.name "Foo Bar"
git config --local user.email "foo.bar@fakeemail.com"

export GIT_PAGER=cat
#+end_src

#+RESULTS:
: Initialized empty Git repository in /home/kmodi/sandbox/git/random_walk/org-version/to_be_deleted/.git/

#+begin_src shell
rm -rf ./.git/hooks/ && find .git -type f
#+end_src

#+RESULTS:
: .git/info/exclude
: .git/description
: .git/HEAD
: .git/config

** Objects
#+begin_src shell
file .git/objects/*/*
#+end_src

#+RESULTS:
: .git/objects/5b/6c6cb672dc1c3e3f38da4cc819c07da510fb59: VAX COFF executable not stripped - version 8325
: .git/objects/a8/826610f06b1097f9d47e1f0f7bcf864e9e34d1: VAX COFF executable - version 15841
: .git/objects/b3/5c99875f5758f64e9348c05dac14848a046f59: VAX COFF executable not stripped - version 25973

Don't worry about the "VAX COFF executable" type listed by ~file~
above. Git actually compresses all the internal blocks using zlib and
so ~file~ couldn't figure out the type correctly. Saves space and
keeps grep clean. Yay!  More details on these files later.
** HEAD
#+begin_src shell
cat .git/HEAD
#+end_src

#+RESULTS:
: ref: refs/heads/main

This is a pointer to current HEAD (or a hash when in "detached HEAD"
state).
* Git Commit Amend
#+begin_src shell
git commit --amend -m "first commit"
#+end_src

#+RESULTS:
:
: [main ba72672] first commit
: Date: Tue Jun 8 23:56:48 2021 -0400
: 1 file changed, 1 insertion(+)
: create mode 100644 README

We just amended the last commit but didn't actually change anything:
same commit message, author, tree, and time.  But the commit hash has
changed. Why?

#+begin_src shell :results output verbatim
git log --pretty=fuller
#+end_src

#+RESULTS:
:
: commit ba72672c499af8b713437d8c05eb5979969954dd (HEAD -> main)
: Author:     Foo Bar <foo.bar@fakeemail.com>
: AuthorDate: Tue Jun 8 23:56:48 2021 -0400
: Commit:     Foo Bar <foo.bar@fakeemail.com>
: CommitDate: Tue Jun 8 23:57:46 2021 -0400
:
: first commit

Because there's more metadata than ~git log~ shows by default ---
There's an author date and a commit date. Amending a commit keeps the
author date but updates the commit date.

Note that Git has separate author and committer to account for the
traditional Linux email based patch workflow. Authors would send in
patches by mail, maintainers pick up patches and commit (or reject).

Rewrite last commit with fixed times (~--date~ sets author date):

#+begin_src shell
GIT_COMMITTER_DATE="Jan 1 12:00 2000 +0000" git commit --amend --date="Jan 1 12:00 2000 +0000" -m "first commit"
#+end_src

#+RESULTS:
: [main 3c0b3cd] first commit
:  Date: Sat Jan 1 12:00:00 2000 +0000
:  1 file changed, 1 insertion(+)
:  create mode 100644 README

Run the same command again:

#+begin_src shell
GIT_COMMITTER_DATE="Jan 1 12:00 2000 +0000" git commit --amend --date="Jan 1 12:00 2000 +0000" -m "first commit"
#+end_src

#+RESULTS:
: [main 3c0b3cd] first commit
:  Date: Sat Jan 1 12:00:00 2000 +0000
:  1 file changed, 1 insertion(+)
:  create mode 100644 README

THAT works! Now the commit hash stays the same because the commit date
is fixed.

#+begin_src shell
git log --pretty=fuller
#+end_src

#+RESULTS:
:
: commit 3c0b3cda6759b19fb341736c29f2273ceba76bae (HEAD -> main)
: Author:     Foo Bar <foo.bar@fakeemail.com>
: AuthorDate: Sat Jan 1 12:00:00 2000 +0000
: Commit:     Foo Bar <foo.bar@fakeemail.com>
: CommitDate: Sat Jan 1 12:00:00 2000 +0000
:
: first commit

Let us fix dates so that we have deterministic hashes.

*For the purposes if this demo only; do NOT do this at home!*

#+begin_src shell
export GIT_COMMITTER_DATE="Jan 1 12:00 2000 +0000"
export GIT_AUTHOR_DATE="Jan 1 12:00 2000 +0000"
#+end_src

#+RESULTS:

#+begin_src shell
file .git/objects/*/*
#+end_src

#+RESULTS:
:
: .git/objects/34/924761f042eab59567ec150a73c730ab2c929c: VAX COFF executable - version 31651
: .git/objects/3c/0b3cda6759b19fb341736c29f2273ceba76bae: VAX COFF executable - version 15841
: .git/objects/5b/6c6cb672dc1c3e3f38da4cc819c07da510fb59: VAX COFF executable not stripped - version 8325
: .git/objects/b3/5c99875f5758f64e9348c05dac14848a046f59: VAX COFF executable not stripped - version 25973
: .git/objects/ba/72672c499af8b713437d8c05eb5979969954dd: VAX COFF executable

That's one tree (we didn't change files so far), one file, three
commits (original, hash test, fixed time).
